#Question: Select all numeric columns except float from the DataFrame `dft`.

In [2]:
import numpy as np
import pandas as pd

In [3]:
dft = pd.DataFrame(
    {
        "A": np.random.rand(3), 
        "B": 1, 
        "C": "foo", 
        "D": pd.Timestamp("20010102"), 
        "E": pd.Series([1.0] * 3).astype("float32"), 
        "F": False, 
        "G": pd.Series([1] * 3, dtype="int8")})

dft

          A  B    C          D    E      F  G
0  0.147279  1  foo 2001-01-02  1.0  False  1
1  0.567481  1  foo 2001-01-02  1.0  False  1
2  0.371220  1  foo 2001-01-02  1.0  False  1

In [7]:
# Select numeric columns excluding float types
numeric_non_float = dft.select_dtypes(include=['int', 'int64', 'int32', 'int16'],exclude =['float'])
numeric_non_float

   B
0  1
1  1
2  1

#Question: How do you return the last 3 rows of a DataFrame `df`?

In [8]:
data = {"state": ["Ohio", "Ohio", "Ohio", "Nevada", "Nevada", "Nevada"],
        "year": [2000, 2001, 2002, 2001, 2002, 2003],
        "pop": [1.5, 1.7, 3.6, 2.4, 2.9, 3.2]}

frame = pd.DataFrame(data)
frame.tail(3)

    state  year  pop
3  Nevada  2001  2.4
4  Nevada  2002  2.9
5  Nevada  2003  3.2

#Question: Return the minimum and maximum of a Series `x` as a new Series with the index `["min", "max"]`.

In [ ]:
sdata = {"Ohio": 35000, "Texas": 71000, "Oregon": 16000, "Utah": 5000}
x = pd.Series(sdata)
x

Ohio      35000
Texas     71000
Oregon    16000
Utah       5000
dtype: int64

In [ ]:
result = pd.Series([x.min(), x.max()], index=["min", "max"])
result

min     5000
max    71000
dtype: int64

Question: Multiply `df1` and `df2` (two DataFrames) with a `fill_value` of 1.

In [19]:
df1 = pd.DataFrame(np.arange(20.).reshape((4, 5)), columns=list("abcde"))
df2 = pd.DataFrame(np.arange(30.).reshape((5, 6)), columns=list("abcdef"))

In [20]:
df1

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [21]:
df2

      a     b     c     d     e     f
0   0.0   1.0   2.0   3.0   4.0   5.0
1   6.0   7.0   8.0   9.0  10.0  11.0
2  12.0  13.0  14.0  15.0  16.0  17.0
3  18.0  19.0  20.0  21.0  22.0  23.0
4  24.0  25.0  26.0  27.0  28.0  29.0

In [22]:
df1.multiply(df2, fill_value=1)

       a      b      c      d      e     f
0    0.0    1.0    4.0    9.0   16.0   5.0
1   30.0   42.0   56.0   72.0   90.0  11.0
2  120.0  143.0  168.0  195.0  224.0  17.0
3  270.0  304.0  340.0  378.0  418.0  23.0
4   24.0   25.0   26.0   27.0   28.0  29.0

#Question: How do you create a DataFrame from a nested dictionary of dictionaries?

In [24]:
nested_dict = {'A': {'a': 1, 'b': 2}, 'B': {'a': 3, 'b': 4}}
frame4 = pd.DataFrame(nested_dict)

frame4

   A  B
a  1  3
b  2  4